In [1]:
import pandas as pd

# Series

In [3]:
data=[1,2,3,4,5]

In [4]:
s=pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index=['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

Agora vamos passar esse index para ser o index da nossa Series

In [7]:
s=pd.Series(data,index=index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

Vamos criar um dicionário e passar esse dicionário para pd.Series()

In [8]:
data={'Linha'+str(i): i+1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [9]:
s=pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

Podemos também somar um número a essa Series

In [11]:
s1=s+2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

Ou podemos somar duas Séries :

In [14]:
s2=s+s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# Dataframe

In [15]:
data=[[1,2,3],
      [4,5,6],
      [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [16]:
df1=pd.DataFrame(data=data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
index=['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [20]:
df1=pd.DataFrame(data=data,index=index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [22]:
columns=['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [23]:
df1=pd.DataFrame(data=data,index=index,columns=columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [36]:
data={'Coluna0':{'Linha0':1,'Linha1':4,'Linha2':7}, #Lembre-se da estrutura, coluna primeiro, linha dps
      'Coluna1':{'Linha0':2,'Linha1':5,'Linha2':8},
      'Coluna2':{'Linha0':3,'Linha1':6,'Linha2':9}}

data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [27]:
df2=pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

Outra maneira de fazer isso seria:

In [28]:
data=[(1,2,3),
      (4,5,6),
      (7,8,9)]

data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [29]:
df3=pd.DataFrame(data=data,index=index,columns=columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

Podemos inserir condicionais também

In [30]:
df1[df1>0]='A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [31]:
df2[df2>0]='B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [32]:
df3[df3>0]='C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

Agora vamos concatenar

In [34]:
df4=pd.concat([df1,df2,df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

Repare que temos rótulos iguais para linhas diferentes

Agora vamos concatenar, porém colocando os dados como coluna

In [35]:
df4=pd.concat([df1,df2,df3],axis=1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C